app/views/welcome/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 18]]
---
                <% else %>
                    <% user = User.find(session[:user_id]) %>