app/controllers/category_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT 1  [["name", "Fortran77"]]
---
  def update
    @category = Category.find_by(name: params[:id])