app/controllers/category_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT 1  [["name", "Assembler"]]
---
  def show
    @category = Category.find_by(name: params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "categories" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["description", "Fortran77"], ["name", "Fortran is a language designed for people above the age of 50."], ["updated_at", "2016-02-25 12:05:40.223563"], ["id", 10]]
---
  def update
    if Category.exists? params[:id]
      @category = Category.find(params[:id])
      @category.update(params.require(:category).permit(:description, :name, :parent_category))