app/controllers/user_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "new6"], ["email", "new6@mail.com"], ["password", "new6new6"], ["created_at", "2016-02-25 08:48:52.776153"], ["updated_at", "2016-02-25 08:48:52.776153"]]
SELECT  1 AS one FROM "users" WHERE ("users"."username" = 'asdfda' AND "users"."id" != 27) LIMIT 1
---
  def create
   @user = User.create(user_params)

    if @user.save
      set_current_user(@user)
      render json: {username: @user.username}
    else
      if @user.errors.any? # If there are errors, do something