app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 18]]
---
  def index
    if session[:id]
      @user = User.find(session[:id])